external/swak/examples/BasicSourceSubclasses/pitzDailyWithExplicitPoroPlug/constant/sourcesProperties
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

plug
{
    type vectorSwakExplicitSource;

    active true;
    timeStart 0;
    duration 1e7;
    selectionMode all;

    vectorSwakExplicitSourceCoeffs {
        variables (
            "xMin=0.05;"
            "xMax=0.075;"
            "resist=1e3;"
        );

        expressions {
            U "-U*(pos().x<xMax && xMin<pos().x ? resist : 0)";
        }

        dimensions [0 1 -2 0 0 0 0];
    }
}


// ************************************************************************* //
